<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
$foreign_characters = array(
	'/ä|æ|ǽ/' => 'ae',
	'/ö|œ/' => 'oe',
	'/ü/' => 'ue',
	'/Ä/' => 'Ae',
	'/Ü/' => 'Ue',
	'/Ö/' => 'Oe',
	'/À|Á|Â|Ã|Ä|Å|Ǻ|Ā|Ă|Ą|А|Ǎ/' => 'A',
	'/à|á|â|ã|å|ǻ|ā|ă|ą|а|ǎ|ª/' => 'a',
	'/Ç|Ć|Ĉ|Ċ|Č|Ц/' => 'C',
	'/ç|ć|ĉ|ċ|č|ц/' => 'c',
	'/Ð|Ď|Д|Đ/' => 'D',
	'/ð|ď|д|đ/' => 'd',
	'/È|É|Ê|Ë|Ē|Ĕ|Ė|Ę|Е|Ě/' => 'E',
	'/è|é|ê|ë|ē|ĕ|ė|ę|е|ё|ě/' => 'e',
	'/Ĝ|Ğ|Ġ|Ģ|Г/' => 'G',
	'/ĝ|ğ|ġ|ģ|г/' => 'g',
	'/Ĥ|Ħ|Х/' => 'H',
	'/ĥ|ħ|х/' => 'h',
	'/Ì|Í|Î|Ï|Ĩ|Ī|Ĭ|Ǐ|Į|İ|И/' => 'I',
	'/ì|í|î|ï|ĩ|ī|ĭ|ǐ|į|ı|и/' => 'i',
	'/Ĵ|Я/' => 'J',
	'/ĵ|я/' => 'j',
	'/Ķ|К/' => 'K',
	'/ķ|к/' => 'k',
	'/Ĺ|Ļ|Ľ|Ŀ|Ł|Л/' => 'L',
	'/ĺ|ļ|ľ|ŀ|ł|л/' => 'l',
	'/Ñ|Ń|Ņ|Ň|Н/' => 'N',
	'/ñ|ń|ņ|ň|ŉ|н/' => 'n',
	'/Ò|Ó|Ô|Õ|Ō|Ŏ|Ǒ|Ő|Ơ|Ø|Ǿ|О/' => 'O',
	'/ò|ó|ô|õ|ō|ŏ|ǒ|ő|ơ|ø|ǿ|º|о/' => 'o',
	'/Ŕ|Ŗ|Ř|Р/' => 'R',
	'/ŕ|ŗ|ř|р/' => 'r',
	'/Ś|Ŝ|Ş|Š|С/' => 'S',
	'/ś|ŝ|ş|š|ſ|с/' => 's',
	'/Ţ|Ť|Ŧ|Т/' => 'T',
	'/ţ|ť|ŧ|т/' => 't',
	'/Ù|Ú|Û|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ư|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ|У/' => 'U',
	'/ù|ú|û|ũ|ū|ŭ|ů|ű|ų|ư|ǔ|ǖ|ǘ|ǚ|ǜ|у/' => 'u',
	'/Ý|Ÿ|Ŷ/' => 'Y',
	'/ý|ÿ|ŷ/' => 'y',
	'/Ŵ/' => 'W',
	'/ŵ/' => 'w',
	'/Ź|Ż|Ž/' => 'Z',
	'/ź|ż|ž/' => 'z',
	'/Æ|Ǽ/' => 'AE',
	'/ß/'=> 'ss',
	'/Ĳ/' => 'IJ',
	'/ĳ/' => 'ij',
	'/Œ/' => 'OE',
	'/Ш|Щ/' => 'SH',
	'/ш|щ/' => 'sh',
	'/ƒ/' => 'f'
);

/* End of file foreign_chars.php */
/* Location: ./application/config/foreign_chars.php */